
#+STARTUP: indent
#+STARTUP: entitiespretty
#+STARTUP: overview
#+STARTUP: showstars
: #+STARTUP: hidestars
: #+STARTUP: latexpreview
: #+STARTUP: imagepreview

*** =OWC Spining drag effect by fluid capacity after c.p=
: engine rpm 2000rpm, and sr0.85, 0.99 CFD calculation
: eccectric drag torque: e=1mm, mass=1kg 4500rpm mu=0.1 :: 22Nm
- CFD Calculation results
  | S.R      | rea speed |     Ti |     Tt |    Ts |         Cf |
  |----------+-----------+--------+--------+-------+------------|
  | 0.85     |       421 | -102.2 |   92.8 |  5.89 |     -25.55 |
  |          |       800 | -78.25 |  74.63 |  0.18 |   -19.5625 |
  | 0.997    |      1960 |   -4.5 |  -2.06 | -0.24 |     -1.125 |
  |          |      1970 |   -4.3 |  -2.23 | -0.29 |     -1.075 |
  |          |      1500 |    -13 |   4.06 |   3.1 |      -3.25 |
  |          |      1400 |  -14.6 |    5.2 |   3.8 |      -3.65 |
  | 4500rpm  |      3000 |  -80.4 |  30.88 |    21 | -3.9703704 |
  | sr=0.997 |      4450 | -21.25 | -11.85 | -1.76 | -1.0493827 |
  #+TBLFM: @2$6..@7$6=$3/4::@8$6..@9$6=$3/4.5^2
: #Reactor rpm in coasting mode is neary same as 75% of turbine speed#
*** =Why reactor eccentric wear?? -- centrifugal force calculation=
 : first condition, some wear all inner surface
 : &after wear amount bigger than moment of friction resistance, the eccentric wear occured&
- Check points for this mechanism
    *1) check reactor inner dimentiosn and eccentric dimension* [[file+sys:C:\emacs\data\VW AQ301 OWC spining issue_조사현황 221203.pptx][wear measurement ppt]]
    *2) check inner race outside dimension*  [[file+sys:c:/emacs/image/OWC check dimension.excalidraw][owc check dimension excalidrae]]
- Calculation centrifugal force by wear amount
  30mm 3.8mm 2.2mm Ø194mm missing the weight, Al 2.7 \times 10^-6 kg/m^3, mass:6.772e-4kg
  |      mass | eccentric |  rpm |       rps |      force |                         |
  |-----------+-----------+------+-----------+------------+-------------------------|
  | 6.7716e-4 |     0.097 | 6500 | 680.67783 |  30.433103 | imbalance force         |
  |     0.007 |      0.01 | 1000 | 104.71967 | 0.76763465 | 7gcm force              |
  |     0.003 |      0.01 | 6500 | 680.67783 |  13.899669 | 3gcm force              |
  |     0.003 |    0.0654 | 6500 | 680.67783 |  90.903837 |                         |
  |      0.94 |   0.00004 | 4000 | 418.87867 |  6.5972712 | initial mis-align force |
  |      0.94 |    0.0001 | 6500 | 680.67783 |  43.552297 | 0.5mm wear force        |
  |      0.94 |   0.00025 | 6500 | 680.67783 |  108.88074 | 0.25mm wear force       |
  #+TBLFM: @2$2=0.194/2::$4=$3*2*3.14159/60::$5=$1*$2*$4^2

- wear amount linear with {force \times velocity \times t}  and  force linear with time, &&Wear = \alpha \times t^2&&
*** Reactor fluid moment calculation
|      rpm |         |      speed |   Moment |         |                  |                |
| impeller | reactor |      ratio | impeller | turbine | reactor pressure | reactor viscos |
|----------+---------+------------+----------+---------+------------------+----------------|
|     4500 |       0 |          0 |   -263.0 |   149.7 |            87.14 |           3.73 |
|     4500 |    4400 | 0.97777778 |    -22.1 |   -13.3 |            -0.45 |          -0.03 |
|     4500 |    4300 | 0.95555556 |    -25.9 |   -10.8 |              1.0 |           0.03 |
|     4500 |    4200 | 0.93333333 |    -29.9 |    -8.0 |             2.56 |           0.09 |
|     6500 |       0 |          0 |     -550 |   314.5 |            181.6 |            7.4 |
|     6500 |    6400 | 0.98461538 |    -43.8 |   -29.3 |               -2 |           -0.1 |
|     6500 |    6300 | 0.96923077 |    -49.4 |   -25.6 |             0.17 |          -0.01 |
|     6500 |    6200 | 0.95384615 |    -55.1 |   -21.9 |             2.32 |           0.07 |
|     6500 |    6100 | 0.93846154 |    -60.4 |   -18.0 |              4.6 |           0.15 |
#+TBLFM: $3=$2/$1

*** D ring extension amount by pressure
- radial extension calculation
  #+begin_src R
    E=10 ; g=0.55 ; t=1.6 ; w = 2.7
    Pre = 0.1 ; dt = Pre/E*t ; dw = dt/t*g*w
    w2 = w+dw
    sprintf("delta w = %.3f, final width = %.3f", dw, w2)
  #+end_src

  #+RESULTS:
  : delta w = 0.015, final width = 2.715
  - Table equation
    |  E | p-rat |   t |   w | P[Mpa] |    dt |      dw |      w2 |
    |----+-------+-----+-----+--------+-------+---------+---------|
    | 10 |  0.47 | 1.6 | 2.7 |    0.2 | 0.032 | 0.02538 | 2.72538 |
    | 10 |  0.55 | 1.6 | 2.7 |    0.1 | 0.016 | 0.01485 | 2.71485 |
    | 10 |  0.33 | 1.6 | 2.7 |    0.2 | 0.032 | 0.01782 | 2.71782 |
    #+TBLFM: $6=$5*$3/$1::$7=$6*$2*$4/$3::$8=$4+$7

*** D-ring design review with POS
   [[https://mail.google.com/mail/u/0/?tab=rm&ogbl#inbox/KtbxLzGSwSkKnlshnVfGvLLwfpddqRqNmL][Email from POS]] : [[file+sys:C:\emacs\data\첨부1_20220511_평화오일씰공업_카펙발레오 AQ301 TVM-G 구동계 17차 717cycle  중단품 고품(D-Ring 102534011_10204505) 분석보고서_송부 (1).pptx][POS 고품분석 보고서]] - [[file+sys:C:/emacs/data/첨부2_1010180361(102534011)_재질 성적서-pdf.pdf][Small]] - [[file+sys:C:\emacs\data\첨부2_1012880321(10204505)_재질 성적서-pdf.pdf][Large]] - [[file+sys:C:\emacs\data\첨부3_디링 설계 특성치 검토.pdf][Design property]]
  1. POS cosidered volume reduction by extention
  2. *The minumum value of compression 0.0156mm is too small??* 
  3. POS calculate extention ratio use only Do/Di
  4. Shore hardness 68 and 70 is OK -- from web search fixing 70~90, moving 60~80
  5. POS design review data  
    : Dring dimension
    |     Max |    Min | Design review     |  Min | Mean |  Max |
    +---------+--------+-------------------+------+------+------|
    | 158.363 |  158.3 | Extension ratio   |  2.5 |  3.7 |  5.0 |
    |  153.55 | 153.45 | Compression ratio |  0.6 |  7.1 | 13.0 |
    |     2.8 |    2.6 | packing density   | 65.3 | 75.7 | 87.6 |
    |    1.67 |   1.53 |                   |      |      |      |

    : Design review from POS calculation data
    | Dring Di | extension ratio | value[mm] | Dinner | calculation |
    |----------+-----------------+-----------+--------+-------------|
    |    146.2 |             2.5 |     3.655 | 153.55 |   1.0502736 |
    |      148 |             3.7 |     5.476 |  153.5 |   1.0371622 |
    |    149.8 |             5.0 |      7.49 | 153.45 |   1.0243658 |

    : Compression value Range
    |       | compression ratio | width | real value |
    |-------+-------------------+-------+------------|
    | large |               0.6 |   2.6 |     0.0156 |
    |       |              13.0 |   2.8 |      0.364 |
    | Small |               3.2 |  3.85 |     0.1232 |
    |       |              11.4 |  4.05 |     0.4617 |
    #+TBLFM: $4=$2*$3/100
    *Too small 0.0156mm ??* -- POS answered bigger than 0 will be OK
- Calculation extension and overlap compression -- ##D ring large##
   #+begin_src R
     t = 1.6 ; wn = 2.7-0.1 ; Rin = (148-1.8)/2 ; Ri2n = (153.5-0.05)/2 ; Rox = (158.3+0.063)/2 ; pr = 1.02
     ern = (Ri2n-Rin)/(Rin+0.5*wn) ; dwn = ern*pr*wn ; w2n = wn-dwn ; spacen = Rox-Ri2n 
     t = 1.6 ; wx = 2.7+0.1 ; Rix = (148+1.8)/2 ; Ri2x = (153.5+0.05)/2 ; Ron = (158.3+0.0)/2
     erx = (Ri2x-Rix)/(Rix+0.5*wx) ; dwx = erx*pr*wx ; w2x = wx-dwx ; spacex = Ron-Ri2x 
     sprintf("Width, Space, Gap, Min =(%f,%f,%f,%f%%), Max=(%f,%f,%f,%f%%)",w2n, spacen, w2n-spacen, (w2n-spacen)/wn*100, w2x, spacex, w2x-spacex, (w2x-spacex)/wx*100)
   #+end_src 

   #+RESULTS:
   : Width, Space, Gap, Min =(2.470786,2.456500,0.014286,0.549473%), Max=(2.729817,2.375000,0.354817,12.672018%)


- Calculation extension and overlap compression -- ##D ring small##  
   #+begin_src R
     t = 2.0 ; wn = 3.95-0.1 ; Rin = (55.8-0.5)/2 ; Ri2n = (58-0.05)/2 ; Rox = (65.0+0.046)/2 ; pr = 1.02
     ern = (Ri2n-Rin)/(Rin+0.5*wn) ; dwn = ern*pr*wn ; w2n = wn-dwn ; spacen = Rox-Ri2n 
     t = 2.0 ; wx = 3.95+0.1 ; Rix = (55.8+0.5)/2 ; Ri2x = (58+0.05)/2 ; Ron = (65.0+0.0)/2
     erx = (Ri2x-Rix)/(Rix+0.5*wx) ; dwx = erx*pr*wx ; w2x = wx-dwx ; spacex = Ron-Ri2x 
     sprintf("Width, Space, Gap, Min =(%f,%f,%f,%f%%), Max=(%f,%f,%f,%f%%)",w2n, spacen, w2n-spacen, (w2n-spacen)/wn*100, w2x, spacex, w2x-spacex, (w2x-spacex)/wx*100)
   #+end_src 
   #+RESULTS:
   : Width, Space, Gap, Min =(3.674065,3.548000,0.126065,3.274418%), Max=(3.930211,3.475000,0.455211,11.239784%)

   

   #+begin_src R
     t = 2.0 ; w = 2.7 ; Ri = (148)/2 ; Ri2 = (153.5)/2 ; Ro = (158.3+0.0315)/2 ; pr = 1.01
     er = (Ri2-Ri)/(Ri+0.5*w) ; dw = er*pr*w ; w2 = w-dw ; space = Ro-Ri2 
     sprintf("Width, Space, Gap =(%f,%f,%f,%f%%)",w2, space, w2-space, (w2-space)/w*100)
   #+end_src 

   #+RESULTS:
   : Width, Space, Gap =(2.600474,2.415750,0.184724,6.841646%)

   


- ANSYS calculation results
  | inside-dis | out-results | ini-out-radius | piston inner dia | overlap | initial width | compresstion ratio | Piossion ratio |
  |------------+-------------+----------------+------------------+---------+---------------+--------------------+----------------|
  |        1.1 |      1.0321 |          31.85 |          32.5115 |  0.3706 |          3.95 |        0.093822785 |           0.45 |
  |            |      1.0473 |          31.85 |          32.5115 |  0.3858 |          3.95 |        0.097670886 |           0.33 |
  |            |       1.027 |          31.85 |          32.5115 |  0.3655 |          3.95 |        0.092531646 |           0.49 |
  #+TBLFM: @2$3=(55.8+3.95*2)/2::@2$4=(65+0.023)/2::$5=($3+$2)-$4::$7=$5/$6

- &&durability finished sample&&
   #+begin_src R
     t = 2.02 ; wn = 3.95 ; Rin = (56.01)/2 ; Ri2n = (58-0.05)/2 ; Rox = (64.9+0.046)/2 ; pr = 1.01
     ern = (Ri2n-Rin)/(Rin+0.5*wn) ; dwn = ern*pr*wn ; w2n = wn-dwn ; spacen = Rox-Ri2n 
     t = 2.02 ; wx = 3.95 ; Rix = (56.01)/2 ; Ri2x = (58+0.05)/2 ; Ron = (64.9+0.0)/2 
     erx = (Ri2x-Rix)/(Rix+0.5*wx) ; dwx = erx*pr*wx ; w2x = wx-dwx ; spacex = Ron-Ri2x 
     sprintf("Width, Space, Gap, Min =(%.3f,%.3f,%.3f,%.3f%%), Max=(%.3f,%.3f,%.3f,%.3f%%)",w2n, spacen, w2n-spacen, (w2n-spacen)/wn*100, w2x, spacex, w2x-spacex, (w2x-spacex)/wx*100)
   #+end_src 

   #+RESULTS:
   : Width, Space, Gap, Min =(3.821,3.498,0.323,8.175%), Max=(3.814,3.425,0.389,9.855%)

   #+begin_src R
     t = 1.6 ; wn = 2.67 ; Rin = (149.29)/2 ; Ri2n = (153.5-0.05)/2 ; Rox = (158.3+0.063)/2 ; pr = 1.01
     ern = (Ri2n-Rin)/(Rin+0.5*wn) ; dwn = ern*pr*wn ; w2n = wn-dwn ; spacen = Rox-Ri2n 
     t = 1.6 ; wx = 2.67 ; Rix = (149.29)/2 ; Ri2x = (153.5+0.05)/2 ; Ron = (158.3+0.0)/2 
     erx = (Ri2x-Rix)/(Rix+0.5*wx) ; dwx = erx*pr*wx ; w2x = wx-dwx ; spacex = Ron-Ri2x 
     sprintf("Width, Space, Gap, Min =(%.3f,%.3f,%.3f,%.3f%%), Max=(%.3f,%.3f,%.3f,%.3f%%)",w2n, spacen, w2n-spacen, (w2n-spacen)/wn*100, w2x, spacex, w2x-spacex, (w2x-spacex)/wx*100)
   #+end_src 

   #+RESULTS:
   : Width, Space, Gap, Min =(2.596,2.457,0.140,5.231%), Max=(2.594,2.375,0.219,8.217%)
- !!inside D ring New concept!!
   #+begin_src R
     t = 2.0 ; wn = 3.95-0.1 ; Rin = (55.8-0.5)/2 ; Ri2n = (58-0.05)/2 ; Rox = (65.25+0.046)/2 ; pr = 1.02
     ern = (Ri2n-Rin)/(Rin+0.5*wn) ; dwn = ern*pr*wn ; w2n = wn-dwn ; spacen = Rox-Ri2n 
     t = 2.0 ; wx = 3.95+0.1 ; Rix = (55.8+0.5)/2 ; Ri2x = (58+0.05)/2 ; Ron = (65.25+0.0)/2
     erx = (Ri2x-Rix)/(Rix+0.5*wx) ; dwx = erx*pr*wx ; w2x = wx-dwx ; spacex = Ron-Ri2x 
     sprintf("Width, Space, Gap, Min =(%f,%f,%f,%f%%), Max=(%f,%f,%f,%f%%)",w2n, spacen, w2n-spacen, (w2n-spacen)/wn*100, w2x, spacex, w2x-spacex, (w2x-spacex)/wx*100)
   #+end_src 

   #+RESULTS:
   : Width, Space, Gap, Min =(3.674065,3.673000,0.001065,0.027665%), Max=(3.930211,3.600000,0.330211,8.153365%)


** VW Design 
- Inner race OWC centering dimention
  | items        | dimension | Reactor |        | Inner |        |   gap |       |
  |              |           |      up |   down |    up |   down |   min |   max |
  |--------------+-----------+---------+--------+-------+--------+-------+-------|
  | 68,YB,YC     |    41.275 |   0.045 |   0.02 | 0.008 | -0.005 | 0.012 |  0.05 |
  | RC(FR)       |    52.444 |   0.074 |  0.044 | 0.008 | -0.005 | 0.036 | 0.079 |
  | RA-inner     |    47.325 |   0.074 |  0.044 | 0.008 | -0.005 | 0.036 | 0.079 |
  | RC-outer     |    69.163 |   0.015 | -0.015 | -0.03 |  -0.06 | 0.015 | 0.075 |
  | Sin SO HYUNG |        37 |   0.045 |   0.02 |   0.0 |  -0.03 |  0.02 | 0.075 |
  | AXO          |    47.325 |   0.115 |  0.045 | 0.008 | -0.008 | 0.037 | 0.123 |
  | TVM          |      34.5 |   0.095 |  0.035 |   0.0 |  -0.03 | 0.035 | 0.125 |
  #+TBLFM: $7=$4-$5::$8=$3-$6

